[
  {
    "MainSupervisorId": "supervisor1",
    "CapstoneId": "SEP490",
    "CampusId": "HCM",
    "SemesterId": "FA24",
    "BusinessAreaId": "7a8503ae-e41b-4718-9532-c4ebc5e5081d",
    "Code": "FA24SE001",
    "FileName": "topic3",
    "FileUrl": "topic/topic3",
    "EnglishName": "Homestay Scheduling System.",
    "VietnameseName": "Hệ thống đặt lịch cho homestay",
    "Abbreviation": "HSS",
    "Description": "Homestay Scheduling System is an online platform designed to simplify the booking and management of homestay reservations. It provides an efficient and user-friendly solution for both hosts and guests, ensuring a seamless booking experience. For guests, the system allows easy browsing of available homestays, filtering options based on location, price, amenities, and availability. Users can view detailed property descriptions, check reviews from previous guests, and make instant bookings with secure payment options. For hosts, the platform offers powerful tools to manage bookings, update availability calendars, set pricing, and communicate with guests through an integrated messaging system. Automated reminders and notifications help ensure smooth scheduling and prevent double bookings. With Homestay Scheduling System, booking and managing homestay accommodations becomes more convenient, reliable, and hassle-free for everyone.",
    "Status": "Approved",
    "DifficultyLevel": "2",
    "CreatedBy": "supervisor1",
    "CreatedDate": "2024-09-12T00:00:00"
  },
  {
    "MainSupervisorId": "supervisor1",
    "CapstoneId": "SEP490",
    "CampusId": "HCM",
    "SemesterId": "SU24",
    "BusinessAreaId": "55afeacc-972c-4724-9ad2-727adc429845",
    "Code": "SU24SE003",
    "FileName": "topic4",
    "FileUrl": "topic/topic4",
    "EnglishName": "Class scheduling system for high schools.",
    "VietnameseName": "Hệ thống xếp lịch học cho trường phổ thông.",
    "Abbreviation": "CSSHS",
    "Description": "Class Scheduling System for High Schools is an advanced online platform designed to streamline the scheduling process for high schools. It provides an efficient way to manage class timetables, allocate teachers, and optimize classroom usage while ensuring minimal conflicts. For administrators, the system automates the scheduling process by considering factors such as subject requirements, teacher availability, and classroom capacity. It helps reduce manual workload and prevents scheduling conflicts, making timetable management more effective and error-free. For teachers, the platform provides an organized view of their assigned classes, enabling them to track their schedules and receive notifications about any changes or updates. For students, the system offers easy access to class schedules, helping them stay updated on their daily lessons, classroom locations, and any modifications made to the timetable. With Class Scheduling System for High Schools, schools can efficiently manage academic schedules, improve coordination, and ensure a smooth learning experience for both students and teachers.",
    "Status": "Approved",
    "DifficultyLevel": "2",
    "CreatedBy": "supervisor1",
    "CreatedDate": "2024-05-12T00:00:00"
  },
  {
    "MainSupervisorId": "supervisor1",
    "CapstoneId": "SEP490",
    "CampusId": "HCM",
    "SemesterId": "SU24",
    "BusinessAreaId": "a46b82bb-803e-4e19-a6e0-5cc3c656fe30",
    "Code": "SU24SE002",
    "FileName": "topic5",
    "FileUrl": "topic/topic5",
    "EnglishName": "Sales Management System for Baby Goods Store Chain",
    "VietnameseName": "Hệ thống quản lý bán hàng cho chuỗi cửa hàng đồ dùng cho em bé.",
    "Abbreviation": "BGSC",
    "Description": "Sales Management System for Baby Goods Store Chain is a comprehensive platform designed to help baby product retailers efficiently manage sales, inventory, and customer interactions across multiple store locations. It streamlines operations, enhances productivity, and provides valuable insights to optimize business performance. For store managers, the system offers real-time tracking of sales, stock levels, and order processing. It helps automate inventory management, preventing stock shortages or overstocking, while also enabling easy product categorization and pricing adjustments. For sales staff, the platform simplifies order processing, provides quick access to product information, and facilitates seamless billing with integrated payment options. It also supports customer loyalty programs and personalized promotions to enhance customer retention. For business owners, the system generates detailed sales reports and analytics, allowing them to monitor performance across different stores, identify trends, and make data-driven decisions to improve profitability. With Sales Management System for Baby Goods Store Chain, managing a retail business becomes more efficient, organized, and customer-friendly, ensuring a smooth shopping experience for parents and caregivers.",
    "Status": "Approved",
    "DifficultyLevel": "1",
    "CreatedBy": "supervisor1",
    "CreatedDate": "2024-05-12T00:00:00"
  },
  {
    "MainSupervisorId": "supervisor1",
    "CapstoneId": "SEP490",
    "CampusId": "HCM",
    "SemesterId": "FA24",
    "BusinessAreaId": "7a8503ae-e41b-4718-9532-c4ebc5e5081d",
    "Code": "FA24SE010",
    "FileName": "topic6",
    "FileUrl": "topic/topic6",
    "EnglishName": "Trip Ticket Booking Application.",
    "VietnameseName": "Ứng dụng đặt vé cho các chuyến đi",
    "Abbreviation": "TTBA",
    "Description": "Trip Ticket Booking Application is a user-friendly platform designed to simplify the process of booking tickets for various types of trips, including flights, buses, trains, and cruises. It provides a seamless experience for travelers by offering an intuitive interface, secure payments, and real-time availability updates. For travelers, the application allows easy browsing of available trips, filtering options based on destination, departure time, price, and travel class. Users can compare ticket prices, view seat availability, and make instant bookings with multiple payment options. For travel operators, the system enables efficient management of ticket sales, seat allocations, and real-time updates on booking status. It also provides tools for handling cancellations, refunds, and promotional offers to attract more customers. With Trip Ticket Booking Application, planning and booking trips becomes faster, more convenient, and stress-free, ensuring a smooth travel experience from start to finish.",
    "Status": "Approved",
    "DifficultyLevel": "2",
    "CreatedBy": "supervisor1",
    "CreatedDate": "2024-09-12T00:00:00"
  },
  {
    "MainSupervisorId": "supervisor1",
    "CapstoneId": "SEP490",
    "CampusId": "HCM",
    "SemesterId": "SP24",
    "BusinessAreaId": "55afeacc-972c-4724-9ad2-727adc429845",
    "Code": "SP24SE003",
    "FileName": "topic7",
    "FileUrl": "topic/topic7",
    "EnglishName": "Multiple-Choice Learning and Practice System.",
    "VietnameseName": "Hệ thống học tập và thực hành trắc nghiệm.",
    "Abbreviation": "MCLPS",
    "Description": "Multiple-Choice Learning and Practice System is an interactive platform designed to help users learn and practice multiple-choice exercises across various subjects. It provides a structured and engaging way to test knowledge, improve understanding, and track progress over time. For learners, the system offers a vast collection of multiple-choice questions categorized by subject, topic, and difficulty level. Users can take practice tests, receive instant feedback on their answers, and review explanations to enhance their learning experience. For educators, the platform provides tools to create, manage, and analyze multiple-choice quizzes. It enables tracking student performance, identifying areas for improvement, and customizing question sets to match specific learning objectives. With Multiple-Choice Learning and Practice System, studying becomes more interactive, effective, and accessible, making it easier for learners to master new concepts and improve their test-taking skills.",
    "Status": "Approved",
    "DifficultyLevel": "2",
    "CreatedBy": "supervisor1",
    "CreatedDate": "2024-02-12T00:00:00"
  },
  {
    "MainSupervisorId": "supervisor1",
    "CapstoneId": "SEP490",
    "CampusId": "HCM",
    "SemesterId": "SP25",
    "BusinessAreaId": "a46b82bb-803e-4e19-a6e0-5cc3c656fe30",
    "Code": "",
    "FileName": "topic8",
    "FileUrl": "topic/topic8",
    "EnglishName": "Handmade Marketplace.",
    "VietnameseName": "Trang thương mại mua bán các tác phẩm thủ công.",
    "Abbreviation": "BSPT",
    "Description": "Handmade Marketplace is an online commercial platform designed to connect artisans and buyers, facilitating the buying and selling of unique, handcrafted products. It provides a space where creators can showcase their handmade works, and customers can discover one-of-a-kind items that are crafted with care and skill. For sellers, the platform offers an easy-to-use interface to list products, manage inventory, set pricing, and communicate with buyers. It also includes promotional tools and analytics to help artisans grow their businesses. For buyers, the marketplace provides a seamless shopping experience with diverse categories of handmade goods, secure payment options, and customer reviews to ensure product quality and authenticity. With Handmade Marketplace, artisans can turn their passion into profit, while buyers can access exclusive, high-quality handmade creations from around the world.",
    "Status": "Pending",
    "DifficultyLevel": "0",
    "CreatedBy": "supervisor1",
    "CreatedDate": "2025-02-12T00:00:00"
  },
  {
    "MainSupervisorId": "supervisor1",
    "CapstoneId": "SEP490",
    "CampusId": "HCM",
    "SemesterId": "SP25",
    "BusinessAreaId": "7a8503ae-e41b-4718-9532-c4ebc5e5081d",
    "Code": "",
    "FileName": "topic9",
    "FileUrl": "topic/topic9",
    "EnglishName": "Event Ticket Booking System.",
    "VietnameseName": "Hệ thống đặt vé các sự kiện.",
    "Abbreviation": "SSH",
    "Description": "Event Ticket Booking System is an efficient and user-friendly platform designed to simplify the process of booking tickets for various events, including concerts, sports matches, theater performances, conferences, and festivals. It ensures a seamless experience for both event organizers and attendees. For attendees, the system provides an intuitive interface to browse upcoming events, filter by date, location, category, and price range, and purchase tickets securely. Users can choose seats (if applicable), receive digital tickets, and get event reminders. For event organizers, the platform offers tools to create and manage events, set ticket pricing, track sales in real time, and handle attendee registrations. It also supports promotional campaigns, discount codes, and analytics to maximize ticket sales. With Event Ticket Booking System, attending and managing events becomes more convenient, organized, and hassle-free, ensuring a smooth experience from ticket purchase to event participation.",
    "Status": "Pending",
    "DifficultyLevel": "1",
    "CreatedBy": "supervisor1",
    "CreatedDate": "2025-02-12T00:00:00"
  },
  {
    "MainSupervisorId": "supervisor1",
    "CapstoneId": "SEP490",
    "CampusId": "HCM",
    "SemesterId": "SP25",
    "BusinessAreaId": "a46b82bb-803e-4e19-a6e0-5cc3c656fe30",
    "Code": "",
    "FileName": "topic10",
    "FileUrl": "topic/topic10",
    "EnglishName": "Smart Home Automation",
    "VietnameseName": "Hệ thống nhà thông minh.",
    "Abbreviation": "SHA",
    "Description": "Smart Home Automation is an intelligent home control system allowing users to manage lighting, temperature, security, and more from a single interface.",
    "Status": "Pending",
    "DifficultyLevel": "2",
    "CreatedBy": "supervisor1",
    "CreatedDate": "2025-02-12T00:00:00"
  }
]
